---
kind: type
id: T:Autodesk.Revit.UI.Macros.DocumentEntryPoint
source: html/35587825-07cb-c541-40d6-3c648cbb5d08.htm
---
# Autodesk.Revit.UI.Macros.DocumentEntryPoint

For Revit Macros use only.

## Syntax (C#)
```csharp
public abstract class DocumentEntryPoint : UIDocument,
	IEntryPoint
```